'''
1. Прогноз погоды и энергии => Анализ CSV с учётом погрешности
2. Аукцион => Динамичные формирование графиков и рекомендации по закупке
3. Расстановка зданий => Построение схемы для эффективной передачи энергии
4. Игра => Предложение заготовленных скриптов, предложения по продаже энергии
'''

#этап 0: pandas для работы с csv, pyplot для отрисовки графиков, pyqt для интерфейса
from PyQt5 import lol
import st1_csv

#этап 1: считывание csv, накидывание погрешности (15%)
#st1_csv

#этап 2: внесение данных о закупках в масивы, формирование графиков на всю игру с каждым новым внесением данных, создание рекоменаций(?)
#st2_shop

#этап 3: построение схемы для передачи энергии(?)
#st3_build

#этап 4: предложение готовых скриптов(?), прогон игры с учётом переданного скрипа, построение графика
#st4_game
